
/* This contains all the data we need about each hotspots
   Hotspots allow us to either travel to a different scene or
   they can display a small info panel with information
   If we don't want to display the info panel then we don't add the "infoText" parameter
*/

import { image } from "motion/react-client";

const hotspotsData = {

  //Example structure
  /**
   * "/images/room0.jpg": [ //This is the current image that is showing
    {
      position: "1 1 -3",   //Position of the hotspot
      image: "/images/room2.jpg", // Clicking this goes to Vader
      color: "#b10000",
      text: "Vader",  //Text on the hotspot
      radius: 0.15,
      infoTitle: "Room 102", //Title of the hotspot
      infoText: "Just an info panel, won't take us back to the other image",  //Text on the info panel when we hover the hotspot
    },
  ],
   */
  /** First image when we enter the application */
  "/images/room0.jpg": [
    {
      sceneTitle: "Αίθουσα Α",
      sceneContent: "Οι εγκαταστάσεις της ΣΠΗΥ βρίσκονται όλες σε ισόγειο χώρο και διαθέτουν κεντρική, αυτόνομη θέρμανση με καλοριφέρ σε όλους τους χώρους-αίθουσες, καθώς και μονάδες κλιματισμού για τη θερινή περίοδο. ",
      position: "1 -0.5 -3",
      gotToImage: "/images/room1.jpg",
      text: "!",
      iconImage: "./images/enter.png",
      infoTitle: "Αίθουσα Β",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },

    {
      sceneTitle: "Μαθήματα",
      sceneContent: "Σας καλωσορίζουμε στον Ιστοχώρο της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών. Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική, γι’ αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση, τις δραστηριότητες εν γένει της Σχολής και είμαστε έτοιμοι να ανταποκριθούμε στις παρατηρήσεις σας.",
      position: "-3 -0.5 -1",
      
      iconImage: "./images/info.png",
      infoTitle: "Μαθήματα",
      infoText: "Αρχές Λειτουργικών Συστημάτων \n Δίκτυα Υπολογιστών\nΓλώσσες Προγραμματισμού Και Δομές Δεδομένων \nΒάσεις Δεδομένων -SQL \nΑνάλυση Συστημάτων – Τυποποίηση – Ασφάλεια \nΠρογραμματισμός Διαδικτύου"
    },
  ],

  "/images/room1.jpg": [
    {
      sceneTitle: "Αίθουσα Β",
      sceneContent: "Οι εγκαταστάσεις της ΣΠΗΥ βρίσκονται όλες σε ισόγειο χώρο και διαθέτουν κεντρική, αυτόνομη θέρμανση με καλοριφέρ σε όλους τους χώρους-αίθουσες, καθώς και μονάδες κλιματισμού για τη θερινή περίοδο.",
      position: "1 1 -3",
      gotToImage: "/images/room2.jpg",
      text: "!",
      iconImage: "./images/enter.png",
      infoTitle: "Αίθουσα Ευκλείδης",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },
  ],


  "/images/room2.jpg": [
    {
      sceneTitle: "Αίθουσα Ευκλείδης",
      sceneContent: "",
      position: "1 1 -3",
      gotToImage: "/images/room3.jpg",
      text: "!",
      iconImage: "./images/enter.png",
      infoTitle: "Διάδρομος",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },
  ],

  
  "/images/room3.jpg": [
    {
      sceneTitle: "Διάδρομος",
      sceneContent: "",
      position: "-1 1 -3",
      iconImage: "./images/info.png",
      infoTitle: "Καλώς ήλθατε στην ιστοσελίδα της Σ.Π.Η.Υ",
      infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },
    {
      position: "1 1 -3",
      gotToImage: "/images/room4.jpg",
      iconImage: "./images/enter.png",
      infoTitle: "Αίθουσα Δημόκριτος-Πυθαγόρας!",

    },
  ],

  "/images/room4.jpg": [
    {
      sceneTitle: "Αίθουσα Δημόκριτος-Πυθαγόρας",
      sceneContent: "Σας καλωσορίζουμε στον Ιστοχώρο της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών. Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική, γι’ αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση, τις δραστηριότητες εν γένει της Σχολής και είμαστε έτοιμοι να ανταποκριθούμε στις παρατηρήσεις σας.",
      position: "1 1 -3",
      gotToImage: "/images/room0.jpg",
      text: "!",
      iconImage: "./images/enter.png",
      infoTitle: "Αίθουσα Α",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },
  ],

};

export default hotspotsData;

