
/* This contains all the data we need about each hotspots
   Hotspots allow us to either travel to a different scene or
   they can display a small info panel with information
   If we don't want to display the info panel then we don't add the "infoText" parameter
*/

import { image } from "motion/react-client";

const hotspotsData = {

  //Example structure
  /**
   * "/360Shots/EntranceHall.jpg.jpg": [ //This is the current image that is showing
    {
      position: "1 1 -3",   //Position of the hotspot
      image: "/images/room2.jpg", // Clicking this goes to Vader
      color: "#b10000",
      text: "Vader",  //Text on the hotspot
      radius: 0.15,
      infoTitle: "Room 102", //Title of the hotspot
      infoText: "Just an info panel, won't take us back to the other image",  //Text on the info panel when we hover the hotspot
    },
  ],
   */
  /** First image when we enter the application */
  "/360Shots/EntranceHall.jpg": [
    {
      sceneTitle: "Σ.Π.Η.Υ.",
      infoTitleName: "ΣΠΗΥ",
      sceneContent: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική. Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής.",
      position: "0 -1 -3.5",
      rotation: "50 0 0",
      gotToImage: "/360Shots/EntranceHallDeep.jpg",
      text: "!",
      iconImage: "/images/icons/uparrow.png",
      infoTitle: "Κύριος Διάδρομος",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },

    // {
    //   sceneTitle: "Μαθήματα",
    //   sceneContent: "Σας καλωσορίζουμε στον Ιστοχώρο της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών. Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική, γι’ αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση, τις δραστηριότητες εν γένει της Σχολής και είμαστε έτοιμοι να ανταποκριθούμε στις παρατηρήσεις σας.",
    //   position: "0 0 3",
      
    //   iconImage: "./images/info.png",
    //   infoTitle: "Μαθήματα",
    //   infoText: "• Αρχές Λειτουργικών Συστημάτων \n • Δίκτυα Υπολογιστών\n • Γλώσσες Προγραμματισμού Και Δομές Δεδομένων \n • Βάσεις Δεδομένων -SQL \n • Ανάλυση Συστημάτων – Τυποποίηση – Ασφάλεια \n • Προγραμματισμός Διαδικτύου"
    // },
  ],

  "/360Shots/EntranceHallDeep.jpg": [
    {
      sceneTitle: "Κύριος Διάδρομος",
      sceneContent: "",
      position: "-0.6 -1 -3",
      rotation: "-80 0 0",
      gotToImage: "/360Shots/NearExit.jpg",
      text: "!",
      iconImage: "/images/icons/uparrow.png",
      infoTitle: "Έξοδος Πίσω Χώρος",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },

    {
      position: "2.5 -1 -1",
      rotation: "30 -45 -35",
      gotToImage: "/360Shots/RightCorridor.jpg",
      text: "!",
      iconImage: "/images/icons/uparrow.png",
      infoTitle: "Μέσα Διάδρομος",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },
  ],

  "/360Shots/RightCorridor.jpg": [
    {
      sceneTitle: "Μέσα Διάδρομος",
      sceneContent: "",
      position: "0 -2 4",
      rotation: "-90 0 0",
      gotToImage: "/360Shots/EntranceHallDeep.jpg",
      text: "!",
      iconImage: "./images/RoomA.jpg",
      infoTitle: "Αίθουσα Α",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },
    {
      sceneTitle: "Μέσα Διάδρομος",
      sceneContent: "",
      position: "-0.1 -1 -4",
      rotation: "-90 0 0",
      gotToImage: "/360Shots/RoomA.jpg",
      text: "!",
      iconImage: "./images/RoomA.jpg",
      infoTitle: "Κύριος Διάδρομος",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },

    {
      sceneTitle: "Μέσα Διάδρομος",
      sceneContent: "",
      position: "-0.5 -1 -1.125",
      rotation: "-90 0 0",
      gotToImage: "/360Shots/RoomBeta.jpg",
      text: "!",
      iconImage: "./images/RoomA.jpg",
      infoTitle: "Αίθουσα Β",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },
  ],

  "/360Shots/RoomA.jpg": [
    {
      sceneTitle: "Αίθουσα Α",
      sceneContent: "",
      position: "2 -1.3 -1.5",
      rotation: "-90 0 0",
      gotToImage: "/360Shots/EntranceHallDeep.jpg",
      text: "!",
      iconImage: "./images/RoomA.jpg",
      infoTitle: "Έξοδος",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },
  ],

  "/360Shots/RoomBeta.jpg": [
    {
      sceneTitle: "Αίθουσα Β",
      sceneContent: "",
      position: "-1.75 -1.3 -3",
      rotation: "-90 0 0",
      gotToImage: "/360Shots/EntranceHallDeep.jpg",
      text: "!",
      iconImage: "./images/RoomA.jpg",
      infoTitle: "Μέσα Διάδρομος",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },
  ],



  "/360Shots/NearExit.jpg": [
    {
      sceneTitle: "Έξοδος Πίσω Χώρος",
      sceneContent: "",
      position: "2 -1.25 -1",
      rotation: "-90 0 0",
      gotToImage: "/360Shots/Outside.jpg",
      text: "!",
      iconImage: "./images/enter.png",
      infoTitle: "Εξωτερικός Χώρος",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },
  ],

  
  "/360Shots/Outside.jpg": [
    //This goes back to the building
    {
      sceneTitle: "Εξωτερικός Χώρος",
      sceneContent: "",
      gotToImage: "/360Shots/NearExit.jpg",
      position: "0.1 -0.6 -3",
      rotation: "55 0 0",
      iconImage: "./images/enter.png",
      infoTitle: "Είσοδος",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },

    //This goes to the down areas
    {
      position: "-7.5 -1.7 -2.5",
      rotation: " -90 0 0",
      gotToImage: "/360Shots/DownCorridor.jpg",
      iconImage: "./images/enter.png",
      infoTitle: "Κάτω Αίθουσες",

    },
  ],

  "/360Shots/DownCorridor.jpg": [
    {

      //Έξοδος
      sceneTitle: "Κάτω Αίθουσες",
      sceneContent: "Οι εγκαταστάσεις της ΣΠΗΥ βρίσκονται όλες σε ισόγειο χώρο και διαθέτουν κεντρική, αυτόνομη θέρμανση με καλοριφέρ σε όλους τους χώρους-αίθουσες, καθώς και μονάδες κλιματισμού για τη θερινή περίοδο.",
      position: "-0.4 -2 -3",
      rotation: "0 20 0",
      gotToImage: "/360Shots/LeftRoom.jpg",
      text: "!",
      iconImage: "./images/enter.png",
      infoTitle: "Έξοδος",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },

    {
      //Αριστερά Αίθουσα
      position: "4 -1 -1",
      rotation: "0 -70 0",
      gotToImage: "/360Shots/LeftRoom.jpg",
      text: "!",
      iconImage: "./images/enter.png",
      infoTitle: "Αίθουσα Ευκλείδης",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },

    {
      //Δεξιά Αίθουσα
      position: "0 -2.4 5",
      rotation: "30 180 0",
      gotToImage: "/360Shots/RightRoom.jpg",
      text: "!",
      iconImage: "./images/enter.png",
      infoTitle: "Αίθουσα Δημόκριτος-Πυθαγόρας",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },
  ],

  "/360Shots/LeftRoom.jpg": [
    {
      sceneTitle: "Αίθουσα Ευκλείδης",
      sceneContent: "",
      position: "4 0 5.25",
      rotation: "180 90 0",
      gotToImage: "/360Shots/DownCorridor.jpg",
      text: "!",
      iconImage: "./images/enter.png",
      infoTitle: "Διάδρομος",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },
  ],

    "/360Shots/RightRoom.jpg": [
    {
      sceneTitle: "Αίθουσα Δημόκριτος-Πυθαγόρας",
      sceneContent: "",
      position: "2 -1 -0.3",
      rotation: "-90 90 0",
      gotToImage: "/360Shots/DownCorridor.jpg",
      text: "!",
      iconImage: "./images/enter.png",
      infoTitle: "Κάτω Αίθουσες",
      //infoText: "Σας καλωσορίζουμε στην ιστοσελίδα της Σχολής Προγραμματιστών Ηλεκτρονικών Υπολογιστών (ΣΠΗΥ). \n Θεωρούμε την επαφή μας με το κοινό ιδιαίτερα σημαντική.\n \n Για το λόγο αυτό με την παρουσία μας στο διαδίκτυο παρέχουμε πληροφορίες για την αποστολή, την οργάνωση, την ιστορία, την εκπαίδευση και εν γένει τις δραστηριότητες της Σχολής."
    },
  ],






};

export default hotspotsData;

